[{"title": "Data Scientist, ML - Insurance Underwriting", "company": "Guardian Life Insurance Company", "location": "New York", "description": "Overview\n\nGuardian is on a transformation journey to evolve into a modern, forward-thinking insurance company committed to enhancing the wellbeing of its customers and their families. This role presents a distinctive opportunity to drive real-world impact by applying cutting-edge AI to transform how Guardian does business.\n\nGuardian’s Data & AI team spearheads a culture of intelligence and automation across the enterprise, creating business value from advanced data and AI solutions. Our team includes data scientists, engineers, analysts, and product leaders working together to deliver AI-driven products that power growth, improve risk management, and elevate customer experience.\n\nGuardian created the Data Science Lab (DSL) to reimagine insurance in light of emerging technology, evolving consumer needs, and rapid advances in AI. The DSL expedites Guardian’s transition to data-driven decision making and fosters innovation by rapidly testing, scaling, and operationalizing state-of-the-art AI.\n\nWe are seeking a Data Scientist, Machine Learning—an experienced individual contributor with strong background in data science & machine learning and a track record of turning advanced research into practical, impactful enterprise solutions. This role focuses on building, deploying, and scaling ML models and intelligent automation solutions that reshape how Guardian operates, serves customers, and drives growth. You’ll collaborate directly with senior executives and cross-functional teams on high-visibility projects to bring next-generation ML to life across Guardian’s products and services.\n\nYou Will:\n\nKey Responsibilities\n• Design and implement machine learning solutions that automate business workflows, improve decision-making, and enhance customer and employee experiences.\n• Apply ML techniques (e.g., regression, classification, clustering, ensemble methods such as Random Forest and XGBoost) to structured and semi-structured data such as claims, underwriting notes, and customer records.\n• Develop robust, scalable, and production-ready ML models that integrate with Guardian’s platforms to deliver measurable business outcomes.\n• Collaborate with data engineers and MLOps teams to ensure models are scalable, robust, and production-ready.\n• Translate research in machine learning and statistical modeling into practical applications for underwriting, claims automation, customer servicing, and risk assessment.\n• Work closely with product owners, engineers, and business stakeholders to define use cases, design solutions, and measure impact.\n• Contribute to building reusable components and frameworks for developing and deploying ML solutions.\n• Adhere to model governance, documentation, testing, and other best practices in partnership with key stakeholders.\n\nYou are:\n• Passionate about applying machine learning to solve real-world business challenges.\n• Curious about new ML techniques and their practical applications in industry.\n• A hands-on builder who enjoys moving solutions from prototype to deployment.\n• Comfortable collaborating in cross-functional teams and aligning technical solutions with business goals.\n• An effective communicator, able to present complex ideas and trade-offs to both technical and non-technical stakeholders.\n\nYou have:\n• PhD with 0–1 years of experience, Master’s degree with 2+ years, or Bachelor’s degree with 4+ years in Statistics, Computer Science, Engineering, Applied Mathematics, or related field.\n• Experience in insurance industry (Underwriting Experience is Preferred)\n• 2+ years of hands-on experience in ML modeling and development.\n• Background in insurance and underwriting preferred\n• Solid understanding of probability, statistics, and machine learning fundamentals.\n• Strong programming skills in Python and familiarity with frameworks like scikit-learn, pandas, and numpy.\n• Experience with a variety of machine learning techniques (regression, classification, clustering, ensemble methods, etc.) and their real-world advantages/drawbacks.\n• Excellent problem-solving and analytical skills with attention to detail.\n• Strong communication skills and ability to collaborate effectively with product and engineering teams.\n• Working knowledge of core software engineering concepts (version control with Git/GitHub, testing, logging)\n\nLocation:\n• Three days a week at a Guardian office in New York, NY, Holmdel, NJ, Bethlehem, PA, or Boston, MA\n\nWork Authorization\n• Guardian Life is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant, you must be legally authorized to work in the United States, without the need for employer sponsorship now or in the future.\n\nSalary Range:\n\n$95,170.00 - $156,355.00\n\nThe salary range reflected above is a good faith estimate of base pay for the primary location of the position. The salary for this position ultimately will be determined based on the education, experience, knowledge, and abilities of the successful candidate. In addition to salary, this role may also be eligible for annual, sales, or other incentive compensation.\n\nOur Promise\n\nAt Guardian, you’ll have the support and flexibility to achieve your professional and personal goals. Through skill-building, leadership development and philanthropic opportunities, we provide opportunities to build communities and grow your career, surrounded by diverse colleagues with high ethical standards.\n\nInspire Well-Being\n\nAs part of Guardian’s Purpose – to inspire well-being – we are committed to offering contemporary, supportive, flexible, and inclusive benefits and resources to our colleagues. Explore our company benefits at\n\nwww.guardianlife.com/careers/corporate/benefits\n\n. Benefits apply to full-time eligible employees. Interns are not eligible for most Company benefits.\n\nEqual Employment Opportunity\n\nGuardian is an equal opportunity employer. All qualified applicants will be considered for employment without regard to age, race, color, creed, religion, sex, affectional or sexual orientation, national origin, ancestry, marital status, disability, military or veteran status, or any other classification protected by applicable law.\n\nAccommodations\n\nGuardian is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. Guardian also provides reasonable accommodations to qualified job applicants (and employees) to accommodate the individual's known limitations related to pregnancy, childbirth, or related medical conditions, unless doing so would create an undue hardship. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact MyHR@glic.com. Please note: this resource is for accommodation requests only. For all other inquires related to your application and careers at Guardian, refer to the Guardian Careers site.\n\nVisa Sponsorship\n\nGuardian is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant. you must be legally authorized to work in the United States, without the need for employer sponsorship.\n\nCurrent Guardian Colleagues: Please apply through the internal Jobs Hub in Workday.", "apply_link": "https://www.indeed.com/viewjob?jk=c0cd0383549f7e3d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.46, "summary": "Location Match: New York", "skills": {"primary_skills": ["Attention to Detail", "Classification", "Clustering", "Communication", "Decision Making", "Ensemble Methods", "Flexibility", "Git", "GitHub", "Insurance", "Leadership", "MLOps", "Machine Learning", "NumPy", "Pandas", "Python", "Random Forest", "Risk Management", "Statistical Modeling", "Teams", "XGBoost", "scikit-learn"], "secondary_skills": [], "all_skills": ["Attention to Detail", "Classification", "Clustering", "Communication", "Decision Making", "Ensemble Methods", "Flexibility", "Git", "GitHub", "Insurance", "Leadership", "MLOps", "Machine Learning", "NumPy", "Pandas", "Python", "Random Forest", "Risk Management", "Statistical Modeling", "Teams", "XGBoost", "scikit-learn"], "skill_frequency": {"Python": 1, "scikit-learn": 1, "XGBoost": 1, "Pandas": 1, "NumPy": 1, "Git": 2, "GitHub": 2, "Teams": 4, "Machine Learning": 7, "Statistical Modeling": 1, "MLOps": 1, "Classification": 3, "Clustering": 2, "Ensemble Methods": 2, "Random Forest": 1, "Communication": 1, "Leadership": 1, "Attention to Detail": 1, "Flexibility": 1, "Decision Making": 1, "Risk Management": 1, "Insurance": 4}, "total_count": 22}, "keywords": [], "evidence_image": null}, {"title": "Sr Data Scientist- NLP, LLM and GenAI", "company": "Spgi", "location": "New York", "description": "About the Role:\n\nGrade Level (for internal use):\n10\n\nSr Data Scientist- NLP, LLM and GenAI\n\nS&P is a leader in risk management solutions leveraging automation and AI/ML. This role is a unique opportunity for hands-on ML scientists and NLP/Gen AI/ LLM scientists to grow into the next step in their career journey and apply her or his technical expertise in NLP, deep learning, GenAI, and LLMs to drive business value for multiple stakeholders while conducting cutting-edge applied research around LLMs, Gen AI, and related areas.\n\nResponsibilities:\n• ML, Gen AI, NLP, LLM Model Development: Design and develop custom ML, Gen AI, NLP, LLM Models for batch and stream processing-based AI ML pipelines. Model components will include data ingestion, preprocessing, search and retrieval, Retrieval Augmented Generation (RAG), NLP/LLM model development, fine-tuning and prompt engineering and ensure the solution meets all technical and business requirements. Work closely with other members of data science, MlOps, technology teams in the design, development, and implementation of the ML model solutions.\n• ML, NLP, LLM Model Evaluation: Work closely with the other data science team members to develop, validate, and maintain robust evaluation solutions and tools to evaluate model performance, accuracy, consistency, reliability, during development, UAT. Implement model optimizations to improve system efficiency.\n• NLP, LLM, Gen AI Model Deployment: Work closely with the MLOps team for the deployment of machine learning models into production environments, ensuring reliability and scalability.\n• Internal Collaboration: Collaborate closely with product teams, business stakeholders, Mlops, machine learning engineers, and software engineers to ensure smooth integration of machine learning models into production systems.\n• Documentation: Write and Maintain comprehensive documentation of ML modeling processes and procedures for reference and knowledge sharing.\n• Develop Models Based on Standards and Best Practices: Ensure that the models are designed and developed while adhering to specified standards, governance and best practices in ML model development as specified by senior Data Science and MLOps leads.\n• Assist in Problem Solving: Troubleshoot complex issues related to machine learning model development and data pipelines and develop innovative solutions.\n\nCompensation/Benefits Information (US Applicants Only):\n\nS&P Global states that the anticipated base salary range for this position is $130,000 - $170,000. Final base salary for this role will be based on the individual's geographical location as well as experience and qualifications for the role.\n\nIn addition to base compensation, this role is eligible for an annual incentive plan.\n\nThis role is eligible to receive additional S&P Global benefits. For more information on the benefits we provide to our employees, please click here.\n\nWhat We're Looking For:\n• Bachelor's / Master's in Computer Science, Mathematics or Statistics, Computational linguistics, Engineering, or a related field.\n• 1+ years of professional hands-on experience leveraging large sets of structured and unstructured data to develop data-driven tactical and strategic analytics and insights using ML, NLP, computer vision solutions.\n• Demonstrated 1+ years hands-on experience with Python, Hugging Face, TensorFlow, Keras, PyTorch, or similar statistical tools. Expert in python programming.\n• 1+ years hands-on experience developing natural language processing (NLP) models, ideally with transformer architectures.\n• 1+ years of experience with implementing information search and retrieval at scale, using a range of solutions ranging from keyword search to semantic search using embeddings.\n• Knowledge of developing or tuning Large Language Models (LLM) and Generative AI (GAI)\n• Knowledge of NLP, LLMs (extractive and generative), fine-tuning and LLM model development. Familiar with higher level trends in LLMs and open-source platforms\n• Nice to have: Experience with contributing to Github and open source initiatives or in research projects and/or participation in Kaggle competitions.\n\nAbout S&P Global Ratings\nAt S&P Global Ratings, our analyst-driven credit ratings, research, and sustainable finance opinions provide critical insights that are essential to translating complexity into clarity so market participants can uncover opportunities and make decisions with conviction. By bringing transparency to the market through high-quality independent opinions on creditworthiness, we enable growth across a wide variety of organizations, including businesses, governments, and institutions.\n\nS&P Global Ratings is a division of S&P Global (NYSE: SPGI). S&P Global is the world's foremost provider of credit ratings, benchmarks, analytics and workflow solutions in the global capital, commodity and automotive markets. With every one of our offerings, we help many of the world's leading organizations navigate the economic landscape so they can plan for tomorrow, today.\n\nFor more information, visit www.spglobal.com/ratings\n\nWhat's In It For You?\n\nOur Mission:\n\nAdvancing Essential Intelligence.\n\nOur People:\n\nWe're more than 35,000 strong worldwide-so we're able to understand nuances while having a broad perspective. Our team is driven by curiosity and a shared belief that Essential Intelligence can help build a more prosperous future for us all.From finding new ways to measure sustainability to analyzing energy transition across the supply chain to building workflow solutions that make it easy to tap into insight and apply it. We are changing the way people see things and empowering them to make an impact on the world we live in. We're committed to a more equitable future and to helping our customers find new, sustainable ways of doing business. Join us and help create the critical insights that truly make a difference.\n\nOur Values:\n\nIntegrity, Discovery, Partnership\n\nThroughout our history, the world's leading organizations have relied on us for the Essential Intelligence they need to make confident decisions about the road ahead. We start with a foundation of integrity in all we do, bring a spirit of discovery to our work, and collaborate in close partnership with each other and our customers to achieve shared goals.\n\nBenefits:\n\nWe take care of you, so you cantake care of business. We care about our people. That's why we provide everything you-and your career-need to thrive at S&P Global.\n\nOur benefits include:\n• Health & Wellness: Health care coverage designed for the mind and body.\n• Flexible Downtime: Generous time off helps keep you energized for your time on.\n• Continuous Learning: Access a wealth of resources to grow your career and learn valuable new skills.\n• Invest in Your Future: Secure your financial future through competitive pay, retirement planning, a continuing education program with a company-matched student loan contribution, and financial wellness programs.\n• Family Friendly Perks: It's not just about you. S&P Global has perks for your partners and little ones, too, with some best-in class benefits for families.\n• Beyond the Basics: From retail discounts to referral incentive awards-small perks can make a big difference.\n\nFor more information on benefits by country visit: https://spgbenefits.com/benefit-summaries\n\nGlobal Hiring and Opportunity at S&P Global:\n\nAt S&P Global, we are committed to fostering a connected andengaged workplace where all individuals have access to opportunities based on their skills, experience, and contributions. Our hiring practices emphasize fairness, transparency, and merit, ensuring that we attract and retain top talent. By valuing different perspectives and promoting a culture of respect and collaboration, we drive innovation and power global markets.\n\nS&P Global has a Securities Disclosure and Trading Policy (\"the Policy\") that seeks to mitigate conflicts of interest by monitoring and placing restrictions on personal securities holding and trading. The Policy is designed to promote compliance with global regulations. In some Divisions, pursuant to the Policy's requirements, candidates at S&P Global may be asked to disclose securities holdings. Some roles may include a trading prohibition and remediation of positions when there is an effective or potential conflict of interest. Employment at S&P Global is contingent upon compliance with the Policy.\n\nRecruitment Fraud Alert:\n\nIf you receive an email from a spglobalind.com domain or any other regionally based domains, it is a scam and should be reported toreportfraud@spglobal.com. S&P Global never requires any candidate to pay money for job applications, interviews, offer letters, \"pre-employment training\" or for equipment/delivery of equipment. Stay informed and protect yourself from recruitment fraud by reviewing our guidelines, fraudulent domains, and how to report suspicious activityhere.\n\n-----------------------------------------------------------\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to:EEO.Compliance@spglobal.comand your request will be forwarded to the appropriate person.\n\nUS Candidates Only:The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdfdescribes discrimination protections under federal law. Pay Transparency Nondiscrimination Provision - https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_%20English_formattedESQA508c.pdf\n\n-----------------------------------------------------------\n\n20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority - Ratings - (Strategic Workforce Planning)", "apply_link": "https://www.ziprecruiter.com/c/S&P-Global/Job/Sr-Data-Scientist-NLP,-LLM-and-GenAI/-in-New-York,NY?jid=6e7473752f3e86ba&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.46, "summary": "Location Match: New York", "skills": {"primary_skills": ["Collaboration", "Computer Vision", "Data Pipelines", "Deep Learning", "Embeddings", "GitHub", "Hugging Face", "Keras", "MLOps", "Machine Learning", "Model Deployment", "NLP", "Problem Solving", "PyTorch", "Python", "RAG", "Retail", "Risk Management", "Search", "Supply Chain", "Teams", "TensorFlow"], "secondary_skills": [], "all_skills": ["Collaboration", "Computer Vision", "Data Pipelines", "Deep Learning", "Embeddings", "GitHub", "Hugging Face", "Keras", "MLOps", "Machine Learning", "Model Deployment", "NLP", "Problem Solving", "PyTorch", "Python", "RAG", "Retail", "Risk Management", "Search", "Supply Chain", "Teams", "TensorFlow"], "skill_frequency": {"Python": 2, "TensorFlow": 1, "PyTorch": 1, "Keras": 1, "Hugging Face": 1, "GitHub": 2, "Teams": 2, "Machine Learning": 4, "Deep Learning": 1, "NLP": 12, "Computer Vision": 1, "MLOps": 4, "Data Pipelines": 1, "Model Deployment": 1, "RAG": 1, "Embeddings": 1, "Collaboration": 2, "Problem Solving": 1, "Risk Management": 1, "Retail": 1, "Supply Chain": 1, "Search": 4}, "total_count": 22}, "keywords": [], "evidence_image": null}, {"title": "Senior Data Scientist/AI Engineer (Remote)", "company": "YouGov", "location": "New York", "description": "THE TEAM & THE JOB\n\nWe are seeking a talented and self-motivated Senior Data Scientist/AI Engineer to join our team. In this role, you will design, build, and deploy next generation AI-driven tools for market research. You will work at the intersection of data science and AI engineering.\n\nWe develop models and predictions using a combination of surveys, voter databases, census microdata, behavioral tracking and other sources. We handle the most difficult data problems at our company, including massive datasets, missing data, self-selection, measurement error, fraud detection, attrition, and many more.\n\nThis is a hands-on role that requires both analytical and programming skills at an advanced level.\n\nWhat You Will Be Doing\n• Design and build AI-powered applications to analyze, summarize, and generate insights from survey data.\n• Contribute to technical design and architecture decisions for AI/ML systems.\n• Develop and optimize prompts and chains.\n• Build applications to simplify analytics and improve the efficiency of data processing.\n• Work with structured and unstructured data\n• Collaborate with data analysts, product managers, UI designers, and software developers to create great products.\n• Contribute to model evaluation and performance tracking using both qualitative and quantitative metrics.\n• Stay up to date with recent developments in AI and machine learning, including LLMs, fine tuning, and RAG pipelines.\n• Handling ambiguous, complex problems with minimal guidance\n• Contribute to technical vision, architectural decisions, or to help setting technical standards.\n• Contribute to business impact and strategic problem-solving at an organizational level as and when required.\n\nKEY COMPETENCIES\n• Master’s or PhD in data science or related field.\n• Demonstrable progressive experience in senior data science/AI engineering roles.\n• Advanced knowledge in Python and/or R for data analysis, modelling, and visualization.\n• Experience working with LLM APIs and building LLM-based applications and frameworks.\n• Progressive experience with natural language processing, including topic modelling, text classification, and summarization.\n• Experience in taking part in cross-functional technical projects.\n• Ability to write clean, maintainable, well-documented code.\n• Proven track record of delivering complex, high-impact solutions.\n• Ability to cross collaborate with other teams across the business.\n\nFor roles based in California, New York, Colorado or Washington State, the base salary hiring range for this position is USD 188,864 - USD 211,600. Compensation offered will be determined by multiple factors including location, job-related knowledge, skills and experience. Certain roles may be eligible for incentive compensation and additional benefits. All US based full time employees are eligible for the following benefits:\n• Paid vacation, holidays and sick days\n• Flexible working arrangement available\n• Group medical, dental and vision insurance\n• Company-paid life and disability insurance\n• Paid parental leave\n• 401(k) with company match\n\nWhy join YouGov?\n\nJoin our global team to help us achieve our social mission: to make millions of people’s opinions heard for the benefit of our local, national, and international communities.\n\nUnderstanding diversity of opinion requires diversity of background. Although our global panel of millions of people worldwide powers our research, our biggest asset is our people. If our research is to be truly representative of what the world thinks, we need people from all walks of life to be part of the team to bring their perspective to the work we do.\n\nLife at YouGov\n\nWe are driven by a set of shared values. We are fast, fearless, and innovative. We work diligently to get it right. We are guided by accuracy, ethics, and proven methodologies. We respect and trust each other, bringing these values into everything that we do.\n\nWe strive to provide YouGovers with best-in-class benefits to support their physical, financial, and emotional wellbeing. We want our employees to have a sense of belonging and uniqueness in a supportive workplace, so they can bring their full selves to work.\n\nEqual Opportunity Employer\n\nAs an Equal Opportunity Employer, qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, gender identity or expression, and sexual orientation), parental status, national origin, marital status, age, disability, genetic information, HIV status, political affiliation, socioeconomic background, veteran status or any other characteristic protected by law or in line with our responsibilities as a fair and ethic employer. All employment decisions are made based on occupational qualifications, merit, and business need.\n\nData Privacy\n\nTo find out how we collect and use your personal data when you apply for a role at YouGov, please read our privacy notice at https://jobs.yougov.com/privacy", "apply_link": "https://www.linkedin.com/jobs/view/senior-data-scientist-ai-engineer-remote-at-yougov-4341702190?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.45, "summary": "Location Match: New York", "skills": {"primary_skills": ["Classification", "Data Analysis", "Insurance", "Machine Learning", "Market Research", "NLP", "Python", "R", "RAG", "Teams"], "secondary_skills": [], "all_skills": ["Classification", "Data Analysis", "Insurance", "Machine Learning", "Market Research", "NLP", "Python", "R", "RAG", "Teams"], "skill_frequency": {"Python": 1, "R": 1, "Teams": 1, "Machine Learning": 1, "Data Analysis": 1, "NLP": 1, "Classification": 1, "RAG": 1, "Market Research": 1, "Insurance": 2}, "total_count": 10}, "keywords": [], "evidence_image": null}, {"title": "Data Scientist, Agentic AI (Insurance Underwriting)", "company": "Guardian Life Insurance Company", "location": "New York", "description": "Overview\n\nGuardian is on a transformation journey to evolve into a modern, forward-thinking insurance company committed to enhancing the wellbeing of its customers and their families. This role presents a distinctive opportunity to drive real-world impact by applying cutting-edge AI to transform how Guardian does business.\n\nGuardian’s Data & AI team spearheads a culture of intelligence and automation across the enterprise, creating business value from advanced data and AI solutions. Our team includes data scientists, engineers, analysts, and product leaders working together to deliver AI-driven products that power growth, improve risk management, and elevate customer experience.\n\nGuardian created the Data Science Lab (DSL) to reimagine insurance in light of emerging technology, evolving consumer needs, and rapid advances in AI. The DSL expedites Guardian’s transition to data-driven decision making and fosters innovation by rapidly testing, scaling, and operationalizing state-of-the-art AI.\n\nWe are seeking a Data Scientist, Agentic AI—an experienced individual contributor with strong experience in Agentic AI, large language models (LLMs), and natural language processing (NLP) and a track record of turning advanced research into practical, impactful enterprise solutions. This role focuses on building, deploying, and scaling agentic AI systems, large language models, and intelligent automation solutions that reshape how Guardian operates, serves customers, and drives growth. You’ll collaborate directly with senior executives on high-visibility projects to bring next-generation AI to life across Guardian’s products and services.\n\nYou Will:\n\nKey Responsibilities\n• Design and implement Agentic AI solutions that automate business workflows, improve decision-making, and enhance customer and employee experiences.\n• Apply LLMs and generative AI to process and interpret unstructured data such as contracts, underwriting notes, claims, medical records, and customer interactions.\n• Develop autonomous agents and reasoning systems that integrate with Guardian’s platforms to deliver measurable business outcomes.\n• Collaborate with data engineers and AIOps teams to ensure models are scalable, robust, and production-ready.\n• Translate research in agentic AI and reinforcement learning into practical applications for underwriting, claims automation, customer servicing, and risk assessment.\n• Work closely with product owners, engineers, and business stakeholders to define use cases, design solutions, and measure impact.\n• Contribute to the Data Science Lab by building reusable components and frameworks for developing and deploying agentic AI solutions.\n• Adhere to AI and LLM governance, documentation, testing, and other best practices in partnership with key stakeholders.\n\nYou are:\n• Passionate about applying advanced AI techniques to solve real-world business challenges.\n• Curious about agentic AI, autonomous systems, and LLM-based solutions that transform industries.\n• A hands-on builder who enjoys moving solutions from prototype to deployment.\n• Comfortable collaborating in cross-functional teams and aligning technical solutions with business goals.\n\nYou have:\n• PhD with 0–1 years of experience, Master’s degree with 2+ years, or Bachelor’s degree with 4+ years in Statistics, Computer Science, Engineering, Applied Mathematics, or related field.\n• Experience in insurance industry (Underwriting Experience is Preferred)\n• 2+ years of hands-on experience in AI/ML modeling and development.\n• Solid understanding of probability, statistics, and machine learning fundamentals.\n• Strong programming skills in Python and familiarity with frameworks like PyTorch, TensorFlow, and LangGraph.\n• Experience with LLMs, generative AI, and multi-step reasoning systems.\n• Excellent problem-solving and analytical skills with attention to detail.\n• Strong communication skills and ability to collaborate effectively with product and engineering teams.\n• Working knowledge of core software engineering concepts (version control with Git/GitHub, testing, logging, ...).\n• Working knowledge of a variety of machine learning techniques (clustering, decision tree, bagging/boosting artificial neural networks, etc.) and their real-world advantages/drawbacks.\n\nLocation:\n• Three days a week at a Guardian office in New York, NY, Holmdel, NJ, Bethlehem, PA, or Boston, MA\n\nWork Authorization\n• Guardian Life is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant, you must be legally authorized to work in the United States, without the need for employer sponsorship now or in the future.\n\nSalary Range:\n\n$95,170.00 - $156,355.00\n\nThe salary range reflected above is a good faith estimate of base pay for the primary location of the position. The salary for this position ultimately will be determined based on the education, experience, knowledge, and abilities of the successful candidate. In addition to salary, this role may also be eligible for annual, sales, or other incentive compensation.\n\nOur Promise\n\nAt Guardian, you’ll have the support and flexibility to achieve your professional and personal goals. Through skill-building, leadership development and philanthropic opportunities, we provide opportunities to build communities and grow your career, surrounded by diverse colleagues with high ethical standards.\n\nInspire Well-Being\n\nAs part of Guardian’s Purpose – to inspire well-being – we are committed to offering contemporary, supportive, flexible, and inclusive benefits and resources to our colleagues. Explore our company benefits at www.guardianlife.com/careers/corporate/benefits\n. Benefits apply to full-time eligible employees. Interns are not eligible for most Company benefits.\n\nEqual Employment Opportunity\n\nGuardian is an equal opportunity employer. All qualified applicants will be considered for employment without regard to age, race, color, creed, religion, sex, affectional or sexual orientation, national origin, ancestry, marital status, disability, military or veteran status, or any other classification protected by applicable law.\n\nAccommodations\n\nGuardian is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. Guardian also provides reasonable accommodations to qualified job applicants (and employees) to accommodate the individual's known limitations related to pregnancy, childbirth, or related medical conditions, unless doing so would create an undue hardship. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact MyHR@glic.com. Please note: this resource is for accommodation requests only. For all other inquires related to your application and careers at Guardian, refer to the Guardian Careers site.\n\nVisa Sponsorship\n\nGuardian is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant. you must be legally authorized to work in the United States, without the need for employer sponsorship.\n\nCurrent Guardian Colleagues: Please apply through the internal Jobs Hub in Workday.", "apply_link": "https://www.glassdoor.com/job-listing/data-scientist-agentic-ai-insurance-underwriting-guardian-life-insurance-company-JV_IC1132348_KO0,48_KE49,80.htm?jl=1009959927954&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.45, "summary": "Location Match: New York", "skills": {"primary_skills": ["Attention to Detail", "Classification", "Clustering", "Communication", "Decision Making", "Flexibility", "Git", "GitHub", "Insurance", "Leadership", "Machine Learning", "NLP", "Neural Networks", "PyTorch", "Python", "Reinforcement Learning", "Risk Management", "Teams", "TensorFlow"], "secondary_skills": [], "all_skills": ["Attention to Detail", "Classification", "Clustering", "Communication", "Decision Making", "Flexibility", "Git", "GitHub", "Insurance", "Leadership", "Machine Learning", "NLP", "Neural Networks", "PyTorch", "Python", "Reinforcement Learning", "Risk Management", "Teams", "TensorFlow"], "skill_frequency": {"Python": 1, "TensorFlow": 1, "PyTorch": 1, "Git": 2, "GitHub": 2, "Teams": 3, "Machine Learning": 2, "NLP": 2, "Reinforcement Learning": 1, "Neural Networks": 1, "Classification": 1, "Clustering": 1, "Communication": 1, "Leadership": 1, "Attention to Detail": 1, "Flexibility": 1, "Decision Making": 1, "Risk Management": 1, "Insurance": 3}, "total_count": 19}, "keywords": [], "evidence_image": null}, {"title": "Data Scientist, ML - Insurance Underwriting", "company": "The Guardian Life Insurance Company of America", "location": "New York", "description": "Overview Guardian is on a transformation journey to evolve into a modern, forward-thinking insurance company committed to enhancing the wellbeing of its customers and their families. This role presents a distinctive opportunity to drive real-world impact by applying cutting-edge AI to transform how Guardian does business. Guardian’s Data & AI team spearheads a culture of intelligence and automation across the enterprise, creating business value from advanced data and AI solutions. Our team includes data scientists, engineers, analysts, and product leaders working together to deliver AI-driven products that power growth, improve risk management, and elevate customer experience. Guardian created the Data Science Lab (DSL) to reimagine insurance in light of emerging technology, evolving consumer needs, and rapid advances in AI. The DSL expedites Guardian’s transition to data-driven decision making and fosters innovation by rapidly testing, scaling, and operationalizing state-of-the-art AI. We are seeking a Data Scientist, Machine Learning—an experienced individual contributor with strong background in data science & machine learning and a track record of turning advanced research into practical, impactful enterprise solutions. This role focuses on building, deploying, and scaling ML models and intelligent automation solutions that reshape how Guardian operates, serves customers, and drives growth. You’ll collaborate directly with senior executives and cross-functional teams on high-visibility projects to bring next-generation ML to life across Guardian’s products and services. You Will: Key Responsibilities Design and implement machine learning solutions that automate business workflows, improve decision-making, and enhance customer and employee experiences. Apply ML techniques (e.g., regression, classification, clustering, ensemble methods such as Random Forest and XGBoost) to structured and semi-structured data such as claims, underwriting notes, and customer records. Develop robust, scalable, and production-ready ML models that integrate with Guardian’s platforms to deliver measurable business outcomes. Collaborate with data engineers and MLOps teams to ensure models are scalable, robust, and production-ready. Translate research in machine learning and statistical modeling into practical applications for underwriting, claims automation, customer servicing, and risk assessment. Work closely with product owners, engineers, and business stakeholders to define use cases, design solutions, and measure impact. Contribute to building reusable components and frameworks for developing and deploying ML solutions. Adhere to model governance, documentation, testing, and other best practices in partnership with key stakeholders. You are: Passionate about applying machine learning to solve real-world business challenges. Curious about new ML techniques and their practical applications in industry. A hands-on builder who enjoys moving solutions from prototype to deployment. Comfortable collaborating in cross-functional teams and aligning technical solutions with business goals. An effective communicator, able to present complex ideas and trade-offs to both technical and non-technical stakeholders. You have: PhD with 0–1 years of experience, Master’s degree with 2+ years, or Bachelor’s degree with 4+ years in Statistics, Computer Science, Engineering, Applied Mathematics, or related field. Experience in insurance industry (Underwriting Experience is Preferred) 2+ years of hands-on experience in ML modeling and development. Background in insurance and underwriting preferred Solid understanding of probability, statistics, and machine learning fundamentals. Strong programming skills in Python and familiarity with frameworks like scikit-learn, pandas, and numpy. Experience with a variety of machine learning techniques (regression, classification, clustering, ensemble methods, etc.) and their real-world advantages/drawbacks. Excellent problem-solving and analytical skills with attention to detail. Strong communication skills and ability to collaborate effectively with product and engineering teams. Working knowledge of core software engineering concepts (version control with Git/GitHub, testing, logging) Location: Three days a week at a Guardian office in New York, NY, Holmdel, NJ, Bethlehem, PA, or Boston, MA Work Authorization Guardian Life is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant, you must be legally authorized to work in the United States, without the need for employer sponsorship now or in the future. Salary Range: $95,170.00 - $156,355.00 The salary range reflected above is a good faith estimate of base pay for the primary location of the position. The salary for this position ultimately will be determined based on the education, experience, knowledge, and abilities of the successful candidate. In addition to salary, this role may also be eligible for annual, sales, or other incentive compensation. Our Promise At Guardian, you’ll have the support and flexibility to achieve your professional and personal goals. Through skill-building, leadership development and philanthropic opportunities, we provide opportunities to build communities and grow your career, surrounded by diverse colleagues with high ethical standards. Inspire Well-Being As part of Guardian’s Purpose – to inspire well-being – we are committed to offering contemporary, supportive, flexible, and inclusive benefits and resources to our colleagues. Explore our company benefits at www.guardianlife.com/careers/corporate/benefits. Benefits apply to full-time eligible employees. Interns are not eligible for most Company benefits. Equal Employment Opportunity Guardian is an equal opportunity employer. All qualified applicants will be considered for employment without regard to age, race, color, creed, religion, sex, affectional or sexual orientation, national origin, ancestry, marital status, disability, military or veteran status, or any other classification protected by applicable law. Accommodations Guardian is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. Guardian also provides reasonable accommodations to qualified job applicants (and employees) to accommodate the individual's known limitations related to pregnancy, childbirth, or related medical conditions, unless doing so would create an undue hardship. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact MyHR@glic.com. Please note: this resource is for accommodation requests only. For all other inquires related to your application and careers at Guardian, refer to the Guardian Careers site. Visa Sponsorship Guardian is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant. you must be legally authorized to work in the United States, without the need for employer sponsorship. Current Guardian Colleagues: Please apply through the internal Jobs Hub in Workday. Every day, Guardian helps our 29 million customers realize their dreams through a range of insurance and financial products and services. Our Purpose, to inspire well-being, guides our dedication to the colleagues, consumers, and communities we serve. We know that people count, and we go above and beyond to prepare them for the life they want to live, focusing on their overall well-being — mind, body, and wallet. As one of the largest mutual insurance companies, we put our customers first. Behind every bright future is a GuardianTM. Learn more about Guardian at guardianlife.com. Visa Sponsorship: Guardian Life is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant, you must be legally authorized to work in the United States, without the need for employer sponsorship.", "apply_link": "https://guardianlife.wd5.myworkdayjobs.com/Guardian-Life-Careers/job/Data-Scientist--ML---Insurance-Underwriting_R000108188?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.45, "summary": "Location Match: New York", "skills": {"primary_skills": ["Attention to Detail", "Classification", "Clustering", "Communication", "Decision Making", "Ensemble Methods", "Flexibility", "Git", "GitHub", "Go", "Insurance", "Leadership", "MLOps", "Machine Learning", "NumPy", "Pandas", "Python", "Random Forest", "Risk Management", "Statistical Modeling", "Teams", "XGBoost", "scikit-learn"], "secondary_skills": [], "all_skills": ["Attention to Detail", "Classification", "Clustering", "Communication", "Decision Making", "Ensemble Methods", "Flexibility", "Git", "GitHub", "Go", "Insurance", "Leadership", "MLOps", "Machine Learning", "NumPy", "Pandas", "Python", "Random Forest", "Risk Management", "Statistical Modeling", "Teams", "XGBoost", "scikit-learn"], "skill_frequency": {"Python": 1, "Go": 1, "scikit-learn": 1, "XGBoost": 1, "Pandas": 1, "NumPy": 1, "Git": 2, "GitHub": 2, "Teams": 4, "Machine Learning": 7, "Statistical Modeling": 1, "MLOps": 1, "Classification": 3, "Clustering": 2, "Ensemble Methods": 2, "Random Forest": 1, "Communication": 1, "Leadership": 1, "Attention to Detail": 1, "Flexibility": 1, "Decision Making": 1, "Risk Management": 1, "Insurance": 6}, "total_count": 23}, "keywords": [], "evidence_image": null}, {"title": "Data Scientist: NYS Attorney General Investigations (6412)", "company": "Office of the Attorney General - New York State", "location": "New York", "description": "Duties Description Executive Division\nResearch and Analytics Department – New York City\nData Scientist\nReference No: RAD_NYC_DAS_6412\nApplication Deadline is December 5, 2025\nSalary is $111,228 + $4,000 in location pay\nTo be considered for this opportunity, submit a complete application online at ag.ny.gov/job-postings/other\nGoal\nThe Research and Analytics Department in the Office of the New York State Attorney General (OAG) is seeking candidates for a full-time Data Scientist position. Data Scientists at OAG bring their skills to bear across a wide variety of cases and investigations. The Data Scientist will utilize a vast array of tools to explore datasets, develop new databases, and use statistical modeling to detect anomalies in information pertinent to OAG investigations. The goal of this position is to ensure OAG’s most complicated cases and policy arenas have the benefit of advanced analytical tools, methodologies, and strategic thinking to understand how otherwise elusive trends can be laid bare once we dive into the underlying data.\n\nPurview\nAs part of an innovative team housed in the Executive Division, you will work with senior staff and divisions throughout OAG to support OAG's major initiatives, investigations, and policy development. Our team researches and writes analytical reports garnering national attention, directs multi-million-dollar grant programs, and supports OAG’s major investigations. See for example: lawsuit against auto lender for deceptive practices, preliminary report on NYPD response to Protests, JUUL lawsuit and remediation, opioids lawsuit, lawsuit preserving affordable housing from illegal kickback scheme, and the FCC fake comments report. Utilizing a vast collection of public and confidential information, you will work with data covering the breadth of OAG’s purview building advanced analytic tools to inform investigations that affect the lives of all New Yorkers.\n\nEmploying over 2,000 people across New York State, OAG is both the “People's Lawyer” and the state's chief legal officer. The Data Scientist will support OAG work in numerous legal and regulatory arenas, including protecting the rights of investors and consumers, coordinating state-wide criminal investigations, promoting civil rights, economic and social justice, encouraging harm-reducing public health strategies, and preserving the state’s environment. The OAG also advises the Executive branch of state government and defends actions and proceedings on behalf of the state.\n\nDuties:\nData can and does play a pivotal role in decisioning on a wide range of OAG’s work. The Data Scientist will be primarily responsible for:\n• All aspects of using data to develop and test legal hypotheses, including:\no Brainstorming with legal teams on the data required\no Acquiring data through public sources and assisting legal teams to acquire data from confidential sources to ensure the delivery of data sufficient for investigation\no Testing data for reliability\no Distilling and incorporating relevant academic and other analytical research\no Developing and executing appropriate methodologies for data exploration and analysis\no Clearly communicating findings verbally and through written reports and visualizations\no Continuously updating analysis in the face of feedback and new data\no Quantifying uncertainty in analytical findings\n• Working closely with legal teams on all the aspects above and providing guidance and recommendations on decision making around data\n• Additional responsibilities may include:\no Developing predictive modeling to detect anomalies\no Developing or programming new databases or data tools\no Writing fact and expert reports for submission to the court and defending analysis and findings in depositions\no Helping to maintain and improve the team’s shared computational infrastructure\no Staying informed of the latest advances in data tools and techniques and sharing newfound skills with the team\no Performing other duties as requested\n\nMinimum Qualifications Qualifications/Skills:\n• Advanced degree in economics, computer science, mathematics, applied statistics, engineering, or similar disciplines with demonstrated research capability or bachelor’s degree and equivalent experience and training\n• At least two (2) years of demonstrated qualitative, quantitative, or investigative research abilities\n• Git/github familiarity\n• Experience with the following technologies:\no Programming, scripting and statistical languages (e.g., Python, R, use of dataframes)\no Data visualization software (e.g., Tableau, d3, altair, plotly, matplotlib, bokeh)\no Relational databases and advanced SQL queries\n• Excellent oral, written, and presentation communication skills\n• Ability to communicate technical concepts and results to non-technical audiences\n• Highly organized, self-directed, and curious\n• Personable and positive, with a high level of integrity\n• Interest in public policy and social/economic justice\n• Candidates with additional experience in any of the following are preferred:\no Linux command line tools\no Cloud, distributed, and container computing platforms (e.g. AWS, Redshift, EC2, docker)\no Machine learning frameworks (e.g. supervised and unsupervised methods such as neural networks, random forests, and generalized linear models)\no Natural Language Processing or Entity Resolution\no Familiarity with accounting principles such as GAAP, general ledger, and audits\n\nAdditional Comments The hiring rate for this position is $111,228 + $4,000 in location pay. As an employee of OAG, you will join a team of dedicated individuals who work to serve the people of our state through a wide variety of occupations. We offer a comprehensive New York state benefits package, including paid leave, health, dental, vision, and retirement benefits, and family-friendly policies. Additionally, OAG offers a robust Workplace Flexibilities Program with multiple options for employees, including telecommuting (up to two days per week) and alternative work schedules.\n\nCandidates from diverse backgrounds are encouraged to apply. The OAG is an equal opportunity employer and is committed to workplace diversity.\n\nSome positions may require additional credentials or a background check to verify your identity.", "apply_link": "https://www.goinhouse.com/jobs/464931208-data-scientist-nys-attorney-general-investigations-6412-at-office-of-the-attorney-general-new-york-state?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.44, "summary": "Location Match: New York", "skills": {"primary_skills": ["AWS", "Communication", "Data Visualization", "Decision Making", "Docker", "Git", "GitHub", "Linear", "Machine Learning", "NLP", "Neural Networks", "Python", "R", "Redshift", "SQL", "Statistical Modeling", "Tableau", "Teams"], "secondary_skills": [], "all_skills": ["AWS", "Communication", "Data Visualization", "Decision Making", "Docker", "Git", "GitHub", "Linear", "Machine Learning", "NLP", "Neural Networks", "Python", "R", "Redshift", "SQL", "Statistical Modeling", "Tableau", "Teams"], "skill_frequency": {"Python": 1, "R": 1, "SQL": 1, "Tableau": 1, "AWS": 1, "Redshift": 1, "Docker": 1, "Git": 2, "GitHub": 2, "Teams": 3, "Linear": 1, "Machine Learning": 1, "Statistical Modeling": 1, "Data Visualization": 1, "NLP": 1, "Neural Networks": 1, "Communication": 1, "Decision Making": 1}, "total_count": 18}, "keywords": [], "evidence_image": null}, {"title": "Assistant Director, Data Scientist (STP)", "company": "Liberty Mutual Insurance", "location": "New York", "description": "Description\n• Collaborates with business partners to develop predictive analytic solutions that enable data-driven strategic decision-making.\n• Utilizes data science techniques to manipulate large structured and unstructured data sets, identify patterns in raw data, and develop models to predict the likelihood of a future outcome and/or to optimize business solutions.\n• Reflects solid knowledge of predictive analytics techniques, while continuing to learn how to apply techniques to business issues.\n• Applies knowledge of sophisticated analytics techniques to manipulate large structured and unstructured data sets to generate insights to inform business decisions.\n• Identifies and tests hypotheses, ensuring statistical significance, as part of building and developing predictive models for business applications.\n• Translates quantitative analyses and findings into accessible visuals for non-technical audiences, providing a clear view into interpreting the data.\n• Enables the business to make clear trade-offs between and among choices, with a reasonable view into likely outcomes.\n• Customizes analytic solutions to specific client needs.\n• Responsible for smaller components of projects of moderate-to-high complexity.\n• Regularly engages with the data science community and participates in cross-functional working groups.\n• Telecommuting permitted up to 100%.\nQualifications\n\nEmployer will accept a Master's degree (or foreign equivalent) in Actuarial Science or related field and four years of experience in the job offered or in a related occupation.\nPosition requires demonstrable experience in the following\n• SAS, SQL, VBA, Excel and Python/R.\n• Demonstrated knowledge of underwriting and ratemaking.\n• Developing multivariate pricing and underwriting models that target profitable segments, using generalized linear models (GLM’s).\n• Demonstrated familiarity with premium dislocation analysis by segment, and calibrating rates for new pricing models.\n• Monitoring pricing model performance.\n• Demonstrated familiarity with competitor analysis and creating actuarial support.\n• Automating dataflows in Python or VBA.\n• Telecommuting permitted up to 100%.\n\nREFER TO: To apply, please visit https://jobs.libertymutualgroup.com/, select “Search Jobs,” enter job requisition #2025-73368 in the “Job ID or Keywords” field, and submit resume. Alternatively, you may apply by submitting a resume via e-mail to RecruitLM@LibertyMutual.com. Reference requisition number in subject of e-mail.\nAbout Us\n\nPay Philosophy: The typical starting salary range for this role is determined by a number of factors including skills, experience, education, certifications and location. The full salary range for this role reflects the competitive labor market value for all employees in these positions across the national market and provides an opportunity to progress as employees grow and develop within the role. Some roles at Liberty Mutual have a corresponding compensation plan which may include commission and/or bonus earnings at rates that vary based on multiple factors set forth in the compensation plan for the role.\n\nAt Liberty Mutual, our goal is to create a workplace where everyone feels valued, supported, and can thrive. We build an environment that welcomes a wide range of perspectives and experiences, with inclusion embedded in every aspect of our culture and reflected in everyday interactions. This comes to life through comprehensive benefits, workplace flexibility, professional development opportunities, and a host of opportunities provided through our Employee Resource Groups. Each employee plays a role in creating our inclusive culture, which supports every individual to do their best work. Together, we cultivate a community where everyone can make a meaningful impact for our business, our customers, and the communities we serve.\n\n \n\nWe value your hard work, integrity and commitment to make things better, and we put people first by offering you benefits that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/Benefits \n \nLiberty Mutual is an equal opportunity employer. We will not tolerate discrimination on the basis of race, color, national origin, sex, sexual orientation, gender identity, religion, age, disability, veteran's status, pregnancy, genetic information or on any basis prohibited by federal, state or local law. \n \nFair Chance Notices \n• California\n• Los Angeles Incorporated\n• Los Angeles Unincorporated\n• Philadelphia\n• San Francisco", "apply_link": "https://searchjobs.libertymutualgroup.com/careers/job/618514352152-assistant-director-data-scientist-stp--new-york-new-york-united-states?domain=libertymutual.com&microsite=libertymutual.com&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.44, "summary": "Location Match: New York", "skills": {"primary_skills": ["Excel", "Flexibility", "Linear", "Python", "R", "SAS", "SQL", "Search", "VBA"], "secondary_skills": [], "all_skills": ["Excel", "Flexibility", "Linear", "Python", "R", "SAS", "SQL", "Search", "VBA"], "skill_frequency": {"Python": 2, "R": 1, "SQL": 1, "VBA": 2, "Excel": 1, "SAS": 1, "Linear": 1, "Flexibility": 1, "Search": 1}, "total_count": 9}, "keywords": [], "evidence_image": null}, {"title": "Sr Data Scientist", "company": "Grubhub", "location": "New York", "description": "Why Work For Us\n\nGrubhub, part of Wonder, is all about connecting hungry diners with our network of over 375,000 merchants nationwide. Innovative technology, user-friendly platforms and streamlined delivery capabilities set us apart and make us an industry leader in the world of online food ordering. When you join our team, you become part of a community that works together to innovate, solve problems, grow, work hard and have a ton of fun in the process!\n\nAbout The Opportunity\n\nThe Experimentation Data Science team nested within the Engineering Team at Grubhub is dedicated to building robust experimentation solutions for teams across Grubhub to guide decision making.\n\nIn this role, you’ll collaborate closely with partnering teams to develop workflows, offer strategic insights, and drive success through projects within the experimentation domain.\n\nWe’re seeking a Senior Data Scientist to tackle key challenges related to experimentation and causal inference in the Diner & Fulfillment area. This position offers a unique opportunity to work with a wide array of cross-functional partners designing, implementing, and analyzing experiments. Experimentation methodologies are central to our long-term strategy, and you will play a vital role as a thought leader in this area for Grubhub.\n\nKey Responsibilities\n• Lead efforts to create scalable, reliable experimentation processes for our evolving Diner & Fulfillment organization.\n• Define evaluation metrics, design experiments, and conduct manual/ad-hoc analyses to become familiar.\n• Leverage the existing Grubhub Experimentation Platform, establish and teach Experimentation best practices, and support data-driven decision-making at scale.\n• Build and maintain strong relationships with stakeholders across product, engineering, operations, design, and other areas.\n• Deliver high-quality solutions through data exploration, data modeling, causal inference and machine learning, with an emphasis on impactful results and valuable contributions to the broader Data Science and Engineering community.\n• Act as a thought leader in experimentation for Diner & Fulfillment, advising Product, Operations, and Engineering teams on best practices and making compelling cases for prioritization and resource investments.\n• This is a high-impact role where your expertise in analytics, causal inference, experimentation, and machine learning will directly shape how key product decisions are made.\n\nWhat You Bring To The Table\n• An advanced degree in a quantitative discipline such as Statistics, Mathematics, Physics, Economics, or a related field.\n• A deep understanding of statistics, with practical experience in experimentation or other areas of product analysis.\n• Solid product insight and intuition, applied in consumer-facing user interface contexts or when supporting technical teams, like product and/or engineering.\n• Proven experience in effectively communicating and driving product decisions among diverse stakeholders.\n• Proficiency in SQL and quantitative programming languages such as Python or R.\n• The ability to clearly articulate technical and statistical ideas to a wide range of audiences with varying levels of expertise.\n• A strong track record of mentoring, collaborating, and enabling others, particularly in your area of expertise.\n• Actively contributes to technical communities by organizing or participating in events such as workshops, seminars, and conferences.\n• Promotes open dialogue and supports diverse viewpoints, ensuring inclusivity across all levels of experience.\n\nBase Salary\n\nNew York: $176,000 - $191,000\n\nIllinois: $158,500 - $172,000\n\nWonder uses geographic-specific salary structures, which means the salary offered may vary depending on where the job is located. The final salary offer will take into account various factors, such as the candidate's skills, education, training, credentials, and experience.\n\nAnd Of Course, Perks!\n• Flexible PTO / PTO. Grubhub employees enjoy a generous amount of time to recharge.\n• Health and Wellness. Excellent medical, dental and vision benefits, 401k, employee network groups and paid parental leave are just a few of our programs to support your overall well-being.\n• Free Meals. Our employees get a weekly Grubhub credit to enjoy.\n• Social Impact. At Grubhub we believe in giving back through programs like the Grubhub Community Fund. Employees are also given paid time off each year to support the causes that are important to them.\n\nGrubhub is an equal opportunity employer. We welcome diversity and encourage a workplace that is just as diverse as the customers we serve. We evaluate qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. If you’re applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an email to TalentAcquisition@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address.\n\nIf you are a resident of the State of California and would like a copy of our CA privacy notice, please email privacy@grubhub.com.", "apply_link": "https://www.linkedin.com/jobs/view/sr-data-scientist-at-grubhub-4326110429?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.43, "summary": "Location Match: New York", "skills": {"primary_skills": ["Causal Inference", "Decision Making", "Experimentation", "Machine Learning", "Mentoring", "Prioritization", "Python", "R", "SQL", "Teams"], "secondary_skills": [], "all_skills": ["Causal Inference", "Decision Making", "Experimentation", "Machine Learning", "Mentoring", "Prioritization", "Python", "R", "SQL", "Teams"], "skill_frequency": {"Python": 1, "R": 1, "SQL": 1, "Teams": 4, "Machine Learning": 2, "Causal Inference": 3, "Mentoring": 1, "Prioritization": 1, "Decision Making": 1, "Experimentation": 11}, "total_count": 10}, "keywords": [], "evidence_image": null}, {"title": "Data Scientist III - AMZ26367.1", "company": "Twitch Interactive, Inc. - D48", "location": "New York", "description": "DESCRIPTION\n\nEmployer: Twitch Interactive, Inc.\n\nPosition: Data Scientist III\n\nLocation: New York, NY\n\nMultiple Positions Available:\n\nOwn the data science elements of various products to help with data-based decision making, product performance optimization, and product performance tracking. Work directly with product managers to help drive the design of the product. Work with Technical Product Managers to help drive the build planning. Translate business problems and products into data requirements and metrics. Initiate the design, development, and implementation of scientific analysis projects or deliverables. Own the analysis, modelling, system design, and development of data science solutions for products. Write documents and make presentations that explain model/analysis results to the business. Bridge the degree of uncertainty in both problem definition and data scientific solution approaches. Build consensus on data, metrics, and analysis to drive business and system strategy.\n\n(40 hours / week, 8:00am-5:00pm, Salary Range $175100 - $236900)\n\nAmazon.com is an Equal Opportunity – Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation\n\nBASIC QUALIFICATIONS\n\nMaster's degree or foreign equivalent in Statistics, Applied Mathematics, Economics, Engineering, Computer Science or a related field and two years of experience in the job offered or a related occupation. Employer will accept a Bachelor's degree or foreign equivalent degree in Statistics, Applied Mathematics, Economics, Engineering, Computer Science, or a related field and five years of progressive post-baccalaureate experience in the job offered or a related occupation as equivalent to the Master's degree and one year of experience. Must have one year of experience in the following skills: 1)building statistical models and machine learning models using large datasets from multiple resources; 2)building complex data analyses by leveraging scripting languages including Python, Java or related scripting language; and 3) communicating with users, technical teams, and management to collect requirements, evaluate alternatives and develop processes and tools to support the organization.\n\nThe base pay range for this position in New York City is USD $175100 - $236900 (yr). Pay is based on market location and may vary depending on job-related knowledge, skills, and experience. A sign-on payment and restricted stock units may be provided as part of the compensation package, in addition to a full range of medical, financial, or other benefits, dependent on the position offered. Applicants should apply via Amazon's internal or external careers site.\n\nPREFERRED QUALIFICATIONS\n\nAll applicants must meet all the above listed requirements.\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.", "apply_link": "https://www.glassdoor.com/job-listing/data-scientist-iii-amz26367-1-twitch-interactive-inc-d48-JV_IC1132348_KO0,29_KE30,56.htm?jl=1009916436078&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.43, "summary": "Location Match: New York", "skills": {"primary_skills": ["Decision Making", "Java", "Machine Learning", "Python", "System Design", "Teams"], "secondary_skills": [], "all_skills": ["Decision Making", "Java", "Machine Learning", "Python", "System Design", "Teams"], "skill_frequency": {"Python": 1, "Java": 1, "Teams": 1, "Machine Learning": 1, "System Design": 1, "Decision Making": 1}, "total_count": 6}, "keywords": [], "evidence_image": null}, {"title": "Senior Data Scientist, ML (Insurance Underwriting)", "company": "Guardianlife", "location": "New York", "description": "Overview\n\nGuardian is on a transformation journey to evolve into a modern, forward-thinking insurance company committed to enhancing the wellbeing of its customers and their families. This role presents a distinctive opportunity to drive real-world impact by applying cutting-edge AI to transform how Guardian does business.\n\nGuardian's Data & AI team spearheads a culture of intelligence and automation across the enterprise, creating business value from advanced data and AI solutions. Our team includes data scientists, engineers, analysts, and product leaders working together to deliver AI-driven products that power growth, improve risk management, and elevate customer experience.\n\nGuardian is seeking experienced individual contributor with a strong background and expertise in production ready AI/ML solutions with a track record of delivering enterprise level AI/ML solutions and products. In this role as Senior Data Scientist, you'll be working in a team of Data Scientists led by Lead Data Scientist to develop advanced data science solutions, leveraging machine learning and artificial intelligence, to drive enterprise-wide innovation across various business lines and Guardian products. You'll collaborate with cross-functional teams of other Data Science, Data Engineering, Business groups. Successful candidates have strong technical foundation, excel in coding, detail oriented, and have passion for analytical thinking and problem solving.\n\nYou Will:\n• Lead use case/workstream with junior data scientists\n• Contribute to the end-to-end model lifecycle, including data exploration and understanding, feature engineering, model training and validation, ensuring quality, security, scalability, and fairness\n• Support use case development that includes initial project scoping, project/sample design, reception and processing of data, performing analysis and modeling to creation of final report/presentation\n• Data wrangling/data matching/ETL to explore a variety of data sources, gain data expertise, perform summary analyses and prepare modeling datasets\n• Utilizing advanced statistical and AI/ML techniques to create high-performing predictive models and creative analyses to address business objectives and partner needs\n• Identification of source data and data quality checks both in model/solution development and in production\n• Packaging of model/solution and deployment in cooperation with Data Engineers and MLOps\n• Implement new statistical or other mathematical methodologies as needed for specific models or analysis.\n• Propose innovative ways to look at problems through using data mining and data visualization\n• Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\n• Present information using data visualization techniques; communicate results and ideas to key decision makers.\n• Ensure data accuracy and consistent reporting by performing regular data quality control, prepare and maintain reports, and troubleshoot data anomalies\n• Adhere to model governance, documentation, testing, and other best practices in partnership with key stakeholders.\n• Consistent accuracy and thoroughness in performing work assignments\n• Attend industry conferences to stay current on industry trends, challenges, and potential market opportunities\n• Contribute to standardization of Data Science tools, processes, and best practices\n• Build LLM/AI powered application prototypes with lightweight UI (e.g., Streamlit) to validate usability and support adoption.\n\nYou are:\n• Passionate about cutting-edge technology and keen on applying new AI/ML algorithms and approaches.\n• Analytically driven, intellectually curious, and experienced leading the development and implementation of data and analytic solutions to solve challenging business problems.\n• Enjoy collaborating with other data scientists to crack hard to solve problems with AI/ML and seeing it deployed in-market and generating value for Guardian.\n• Enjoy collaborating with a multi-disciplinary team including data engineers, business analysts, software developers and functional business experts and business leaders.\nYou have:\n• PhD with 2+ years of experience, Master's degree with 4+ years of experience in Statistics, Computer Science, Engineering, Applied mathematics or related field\n• Experience in Insurance Underwriting\n• 3+ years of hands-on ML modeling/development experience\n• Background in insurance and underwriting preferred\n• Solid understanding of data analysis and statistical modeling.\n• Knowledge of a variety of machine learning techniques (clustering, decision tree, bagging/boosting artificial neural networks, etc.) and their real-world advantages/drawbacks.\n• Demonstrated track records in experimental design and executions\n• Hands-on experience with data wrangling including fuzzy matching and regular expression, distributed computing and applying parallelism to ML solutions\n• Strong programming skills in Python\n• Solid background in algorithms and a range of ML models\n• Excellent communication skills and ability to work and collaborate cross-functionally with Product, Engineering, and other disciplines at both the leadership and hands-on level\n• Excellent analytical and problem-solving abilities with superb attention to detail\n• Proven experience in providing technical leadership and mentoring to data scientists and strong project management skills with ability to monitor/track performance for enterprise success\n• Experience communicating complex ideas simply, presenting impact, trade-offs, and recommendations to non-technical partners.\n• Working knowledge of core software engineering concepts (version control with Git/GitHub, testing, logging, ...).\n• Working knowledge of NLP, LLMs, RAG architecture, and agent frameworks, including safe automation design and evaluation systems.\n• Experience in insurance, financial services, or related industries is a plus\n\nLocation:\n• Three days a week at a Guardian office in New York, NY, Holmdel, NJ, Bethlehem, PA, or Boston, MA\n\nWork Authorization\n• Guardian Life is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant, you must be legally authorized to work in the United States, without the need for employer sponsorship now or in the future.\n\nSalary Range:\n\n$118,980.00 - $195,465.00\n\nThe salary range reflected above is a good faith estimate of base pay for the primary location of the position. The salary for this position ultimately will be determined based on the education, experience, knowledge, and abilities of the successful candidate. In addition to salary, this role may also be eligible for annual, sales, or other incentive compensation.\n\nOur Promise\n\nAt Guardian, you'll have the support and flexibility to achieve your professional and personal goals. Through skill-building, leadership development and philanthropic opportunities, we provide opportunities to build communities and grow your career, surrounded by diverse colleagues with high ethical standards.\n\nInspire Well-Being\n\nAs part of Guardian's Purpose - to inspire well-being - we are committed to offering contemporary, supportive, flexible, and inclusive benefits and resources to our colleagues. Explore our company benefits at www.guardianlife.com/careers/corporate/benefits.Benefits apply to full-time eligible employees. Interns are not eligible for most Company benefits.\n\nEqual Employment Opportunity\n\nGuardian is an equal opportunity employer. All qualified applicants will be considered for employment without regard to age, race, color, creed, religion, sex, affectional or sexual orientation, national origin, ancestry, marital status, disability, military or veteran status, or any other classification protected by applicable law.\n\nAccommodations\n\nGuardian is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities.Guardian also provides reasonable accommodations to qualified job applicants (and employees) to accommodate the individual's known limitations related to pregnancy, childbirth, or related medical conditions, unless doing so would create an undue hardship. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact MyHR@glic.com. Please note: this resource is for accommodation requests only. For all other inquires related to your application and careers at Guardian, refer to the Guardian Careers site.\n\nVisa Sponsorship\n\nGuardian is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant. you must be legally authorized to work in the United States, without the need for employer sponsorship.\n\nCurrent Guardian Colleagues: Please apply through the internal Jobs Hub in Workday.", "apply_link": "https://www.ziprecruiter.com/c/Guardianlife/Job/Senior-Data-Scientist,-ML-(Insurance-Underwriting)/-in-New-York,NY?jid=86bd1f07a97b7aaf&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.41, "summary": "Location Match: New York", "skills": {"primary_skills": ["Analytical Thinking", "Attention to Detail", "Classification", "Clustering", "Communication", "Data Analysis", "Data Engineering", "Data Mining", "Data Visualization", "ETL", "Excel", "Feature Engineering", "Flexibility", "Git", "GitHub", "Insurance", "Leadership", "MLOps", "Machine Learning", "Mentoring", "NLP", "Neural Networks", "Problem Solving", "Project Management", "Python", "RAG", "Risk Management", "Statistical Modeling", "Teams"], "secondary_skills": [], "all_skills": ["Analytical Thinking", "Attention to Detail", "Classification", "Clustering", "Communication", "Data Analysis", "Data Engineering", "Data Mining", "Data Visualization", "ETL", "Excel", "Feature Engineering", "Flexibility", "Git", "GitHub", "Insurance", "Leadership", "MLOps", "Machine Learning", "Mentoring", "NLP", "Neural Networks", "Problem Solving", "Project Management", "Python", "RAG", "Risk Management", "Statistical Modeling", "Teams"], "skill_frequency": {"Python": 1, "Excel": 1, "Git": 2, "GitHub": 2, "Teams": 1, "Machine Learning": 2, "NLP": 1, "Data Analysis": 1, "Statistical Modeling": 1, "ETL": 1, "MLOps": 1, "Data Visualization": 2, "Data Engineering": 1, "Data Mining": 1, "Neural Networks": 1, "Feature Engineering": 1, "Classification": 1, "Clustering": 1, "RAG": 1, "Communication": 1, "Problem Solving": 1, "Analytical Thinking": 1, "Leadership": 3, "Mentoring": 1, "Attention to Detail": 1, "Flexibility": 1, "Project Management": 1, "Risk Management": 1, "Insurance": 4}, "total_count": 29}, "keywords": [], "evidence_image": null}, {"title": "Data Scientist I AI & Human Health", "company": "Mount Sinai Health System", "location": "New York", "description": "Description\n\nData Scientist 1 will be responsible for developing and enhancing machine learning products. They will collaborate with a multidisciplinary team of engineers and clinicians to address a wide range of issues related to clinical effectiveness and process improvement. This position will apply scientific rigor and statistical methods to the challenges of product development and enhancement while considering the behaviors of the end user.\n\nThe AIMS Lab at the Icahn School of Medicine at Mount Sinai seeks a highly skilled Data Scientist to join our team within the Windreich Department of Artificial Intelligence and Human Health. This position offers an exceptional opportunity to advance the state-of-the-art in clinical informatics by developing novel algorithms for electronic health records analysis with a focus on advanced phenotyping and information retrieval.\n\nThe successful candidate will leverage expertise in deep learning statistical mechanics and graph neural networks to build innovative computational solutions that address critical challenges in biomedical data science. This role is ideal for a researcher passionate about translating cutting-edge deep learning techniques into impactful clinical applications.\n\nResponsibilities\n\nDesign develop and implement advanced deep learning algorithms for electronic health records (EHR) analysis with emphasis on patient phenotyping and information retrieval\n\nApply graph neural networks to model complex relationships within clinical data and healthcare networks\n\nUtilize deep learning frameworks (TensorFlow PyTorch) to build scalable and robust predictive models\n\nIntegrate principles of statistical mechanics into algorithm development for enhanced modeling of complex physiological systems\n\nCollaborate with clinical researchers physicians and interdisciplinary teams to translate algorithmic innovations into clinically meaningful applications\n\nConduct rigorous validation and evaluation of developed algorithms using appropriate statistical methods\n\nContribute to scientific publications and present research findings at academic conferences\n\nMaintain comprehensive documentation of methodologies code and experimental results\n\nStay current with emerging trends in machine learning clinical informatics and computational healthcare\n\nQualifications\n• Masters degree in a quantitative discipline (e.g. Statistics Operations Research Bioinformatics Economics Computational Biology Computer Science Information Technology Mathematics Physics) or equivalent practical experience.\n• 2 years of work experience in data science software engineering or data analysis\n• Experience with at least one programming language among Scala Python Java C or C.\n• Experience with database languages (e.g. SQL NoSQL)\n• Familiarity with cloud computing platforms (e.g. AWS Azure GCP)\n• Experience with version control systems (e.g. Git)\n• Knowledge of big data technologies (e.g. Hadoop Spark)\n• Self-motivated with a demonstrated ability to work independently and to exercise independent judgment in developing complex techniques or programs in a dynamic environment.\n\nPreferred Qualifications\n\nExperience working with electronic health records data and clinical databases\n\nKnowledge of healthcare data standards (FHIR OMOP ICD SNOMED-CT)\n\nFamiliarity with clinical phenotyping methodologies and natural language processing for clinical text\n\nExperience with distributed computing and cloud platforms (AWS Google Cloud Azure)\n\nPublications in peer-reviewed journals or conferences in machine learning computational biology or medical informatics\n\nExperience with version control systems (Git) and collaborative software development practices\n\nKey Skills\n\nLaboratory Experience,Immunoassays,Machine Learning,Biochemistry,Assays,Research Experience,Spectroscopy,Research & Development,cGMP,Cell Culture,Molecular Biology,Data Analysis Skills\n\nEmployment Type : Full-Time\n\nExperience : years\n\nVacancy : 1", "apply_link": "https://www.talent.com/view?id=996e7c9af80e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.4, "summary": "Location Match: New York", "skills": {"primary_skills": ["AWS", "Azure", "Big Data", "C", "Cloud Computing", "Data Analysis", "Deep Learning", "GCP", "Git", "Google Cloud", "Hadoop", "Healthcare", "Java", "Machine Learning", "NLP", "Neural Networks", "PyTorch", "Python", "SQL", "Scala", "Spark", "Teams", "TensorFlow"], "secondary_skills": [], "all_skills": ["AWS", "Azure", "Big Data", "C", "Cloud Computing", "Data Analysis", "Deep Learning", "GCP", "Git", "Google Cloud", "Hadoop", "Healthcare", "Java", "Machine Learning", "NLP", "Neural Networks", "PyTorch", "Python", "SQL", "Scala", "Spark", "Teams", "TensorFlow"], "skill_frequency": {"Python": 1, "Java": 1, "C": 2, "Scala": 1, "SQL": 1, "TensorFlow": 1, "PyTorch": 1, "Spark": 1, "Hadoop": 1, "AWS": 2, "Azure": 2, "GCP": 1, "Google Cloud": 1, "Git": 4, "Teams": 1, "Machine Learning": 4, "Deep Learning": 4, "Data Analysis": 2, "Big Data": 1, "NLP": 1, "Neural Networks": 2, "Cloud Computing": 1, "Healthcare": 3}, "total_count": 23}, "keywords": [], "evidence_image": null}, {"title": "Data Scientist I - AI & Human Health", "company": "Mount Sinai Health Systems", "location": "New York", "description": "Description\n\nData Scientist 1 will be responsible for developing and enhancing machine learning products. They will collaborate with a multidisciplinary team of engineers and clinicians to address a wide range of issues related to clinical effectiveness and process improvement. This position will apply scientific rigor and statistical methods to the challenges of product development and enhancement, while considering the behaviors of the end user.\n\nThe AIMS Lab at the Icahn School of Medicine at Mount Sinai seeks a highly skilled Data Scientist to join our team within the Windreich Department of Artificial Intelligence and Human Health. This position offers an exceptional opportunity to advance the state-of-the-art in clinical informatics by developing novel algorithms for electronic health records analysis, with a focus on advanced phenotyping and information retrieval.\n\nThe successful candidate will leverage expertise in deep learning, statistical mechanics, and graph neural networks to build innovative computational solutions that address critical challenges in biomedical data science. This role is ideal for a researcher passionate about translating cutting-edge deep learning techniques into impactful clinical applications.\n\nResponsibilities\n• Design, develop, and implement advanced deep learning algorithms for electronic health records (EHR) analysis, with emphasis on patient phenotyping and information retrieval\n• Apply graph neural networks to model complex relationships within clinical data and healthcare networks\n• Utilize deep learning frameworks (TensorFlow, PyTorch) to build scalable and robust predictive models\n• Integrate principles of statistical mechanics into algorithm development for enhanced modeling of complex physiological systems\n• Collaborate with clinical researchers, physicians, and interdisciplinary teams to translate algorithmic innovations into clinically meaningful applications\n• Conduct rigorous validation and evaluation of developed algorithms using appropriate statistical methods\n• Contribute to scientific publications and present research findings at academic conferences\n• Maintain comprehensive documentation of methodologies, code, and experimental results\n• Stay current with emerging trends in machine learning, clinical informatics, and computational healthcare\n\nQualifications\n• Master's degree in a quantitative discipline (e.g., Statistics, Operations Research, Bioinformatics, Economics, Computational Biology, Computer Science, Information Technology, Mathematics, Physics) or equivalent practical experience.\n• 2 years of work experience in data science, software engineering, or data analysis\n• Experience with at least one programming language among Scala, Python, Java, C, or C++.\n• Experience with database languages (e.g., SQL, NoSQL)\n• Familiarity with cloud computing platforms (e.g., AWS, Azure, GCP)\n• Experience with version control systems (e.g., Git)\n• Knowledge of big data technologies (e.g., Hadoop, Spark)\n• Self-motivated with a demonstrated ability to work independently, and to exercise independent judgment in developing complex techniques or programs in a dynamic environment.\n\nPreferred Qualifications\n• Experience working with electronic health records data and clinical databases\n• Knowledge of healthcare data standards (FHIR, OMOP, ICD, SNOMED-CT)\n• Familiarity with clinical phenotyping methodologies and natural language processing for clinical text\n• Experience with distributed computing and cloud platforms (AWS, Google Cloud, Azure)\n• Publications in peer-reviewed journals or conferences in machine learning, computational biology, or medical informatics\n• Experience with version control systems (Git) and collaborative software development practices\n\nEmployer Description\n\nStrength through Unity and Inclusion\n\nThe Mount Sinai Health System is committed to fostering an environment where everyone can contribute to excellence. We share a common dedication to delivering outstanding patient care. When you join us, you become part of Mount Sinai’s unparalleled legacy of achievement, education, and innovation as we work together to transform healthcare. We encourage all team members to actively participate in creating a culture that ensures fair access to opportunities, promotes inclusive practices, and supports the success of every individual.\n\nAt Mount Sinai, our leaders are committed to fostering a workplace where all employees feel valued, respected, and empowered to grow. We strive to create an environment where collaboration, fairness, and continuous learning drive positive change, improving the well-being of our staff, patients, and organization. Our leaders are expected to challenge outdated practices, promote a culture of respect, and work toward meaningful improvements that enhance patient care and workplace experiences. We are dedicated to building a supportive and welcoming environment where everyone has the opportunity to thrive and advance professionally. Explore this opportunity and be part of the next chapter in our history.\n\nAbout the Mount Sinai Health System:\n\nMount Sinai Health System is one of the largest academic medical systems in the New York metro area, with more than 48,000 employees working across eight hospitals, more than 400 outpatient practices, more than 300 labs, a school of nursing, and a leading school of medicine and graduate education. Mount Sinai advances health for all people, everywhere, by taking on the most complex health care challenges of our time — discovering and applying new scientific learning and knowledge; developing safer, more effective treatments; educating the next generation of medical leaders and innovators; and supporting local communities by delivering high-quality care to all who need it. Through the integration of its hospitals, labs, and schools, Mount Sinai offers comprehensive health care solutions from birth through geriatrics, leveraging innovative approaches such as artificial intelligence and informatics while keeping patients’ medical and emotional needs at the center of all treatment. The Health System includes more than 9,000 primary and specialty care physicians; 13 joint-venture outpatient surgery centers throughout the five boroughs of New York City, Westchester, Long Island, and Florida; and more than 30 affiliated community health centers. We are consistently ranked by U.S. News & World Report's Best Hospitals, receiving high \"Honor Roll\" status, and are highly ranked: No. 1 in Geriatrics, top 5 in Cardiology/Heart Surgery, and top 20 in Diabetes/Endocrinology, Gastroenterology/GI Surgery, Neurology/Neurosurgery, Orthopedics, Pulmonology/Lung Surgery, Rehabilitation, and Urology. New York Eye and Ear Infirmary of Mount Sinai is ranked No. 12 in Ophthalmology. U.S. News & World Report’s “Best Children’s Hospitals” ranks Mount Sinai Kravis Children's Hospital among the country’s best in several pediatric specialties. The Icahn School of Medicine at Mount Sinai is ranked No. 11 nationwide in National Institutes of Health funding and in the 99th percentile in research dollars per investigator according to the Association of American Medical Colleges. Newsweek’s “The World’s Best Smart Hospitals” ranks The Mount Sinai Hospital as No. 1 in New York and in the top five globally, and Mount Sinai Morningside in the top 20 globally.\n\nEqual Opportunity Employer\n\nThe Mount Sinai Health System is an equal opportunity employer, complying with all applicable federal civil rights laws. We do not discriminate, exclude, or treat individuals differently based on race, color, national origin, age, religion, disability, sex, sexual orientation, gender, veteran status, or any other characteristic protected by law. We are deeply committed to fostering an environment where all faculty, staff, students, trainees, patients, visitors, and the communities we serve feel respected and supported. Our goal is to create a healthcare and learning institution that actively works to remove barriers, address challenges, and promote fairness in all aspects of our organization.\n\nCompensation\n\nThe Mount Sinai Health System (MSHS) provides salary ranges that comply with the New York City Law on Salary Transparency in Job Advertisements. The salary range for the role is $109000 - $163695 Annually. Actual salaries depend on a variety of factors, including experience, education, and operational need. The salary range or contractual rate listed does not include bonuses/incentive, differential pay or other forms of compensation or benefits.", "apply_link": "https://careers.mountsinai.org/jobs/3033041?lang=en-us&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.39, "summary": "Location Match: New York", "skills": {"primary_skills": ["AWS", "Azure", "Big Data", "C", "Cloud Computing", "Collaboration", "Data Analysis", "Deep Learning", "GCP", "Git", "Google Cloud", "Hadoop", "Healthcare", "Java", "Machine Learning", "NLP", "Neural Networks", "PyTorch", "Python", "SQL", "Scala", "Spark", "Teams", "TensorFlow"], "secondary_skills": [], "all_skills": ["AWS", "Azure", "Big Data", "C", "Cloud Computing", "Collaboration", "Data Analysis", "Deep Learning", "GCP", "Git", "Google Cloud", "Hadoop", "Healthcare", "Java", "Machine Learning", "NLP", "Neural Networks", "PyTorch", "Python", "SQL", "Scala", "Spark", "Teams", "TensorFlow"], "skill_frequency": {"Python": 1, "Java": 1, "C": 2, "Scala": 1, "SQL": 1, "TensorFlow": 1, "PyTorch": 1, "Spark": 1, "Hadoop": 1, "AWS": 2, "Azure": 2, "GCP": 1, "Google Cloud": 1, "Git": 4, "Teams": 1, "Machine Learning": 3, "Deep Learning": 4, "Data Analysis": 1, "Big Data": 1, "NLP": 1, "Neural Networks": 2, "Cloud Computing": 1, "Collaboration": 1, "Healthcare": 5}, "total_count": 24}, "keywords": [], "evidence_image": null}, {"title": "Zappos Data Scientist III, Zappos/Shopbop Catalog Engineering", "company": "Zappos.com LLC", "location": "New York", "description": "DESCRIPTION\n\nAs a Data Scientist on the Shopbop/Zappos Catalog Tech team, you will design and implement scientific approaches to revolutionize how we manage and enhance our product catalog data for our world-class selection of Shoes, Kids, and Active wear. You will work with Zappos' Senior leadership team to solve complex data challenges through advanced analytics and machine learning - creating innovative solutions and influencing product decisions through data-driven insights. You will lead critical initiatives to reduce catalog errors, accelerate product data capture, and develop state-of-the-art image classification systems for fashion features. You will partner daily with engineering teams and business stakeholders to provide expert guidance on model selection and implementation. As a member of the Zappos technical staff, you will leverage machine learning technologies and have access to industry leaders in AI/ML and E-Commerce to help grow your expertise. You will also routinely collaborate with data science teams across our sister companies at Amazon.com and Shopbop.com. You will push the boundaries of what's possible with applied machine learning and bring innovative solutions to bear for customers (including computer vision, NLP, and advanced ML models). You will think big about how data science can transform our catalog operations and be persistent in delivering robust, scalable solutions.\n\nKey job responsibilities\nDesign and implement machine learning approaches to improve catalog data quality. Develop and validate scientific methodologies for automated data capture and classification. Partner with engineering teams to integrate ML models into production systems. Create and present analysis that drives decision-making at the senior leadership level.\n\nA day in the life\nYou start the day reviewing model performance metrics, noting some drift in the image classification system that needs investigation. You spend the morning developing a new approach to reduce product attribute errors using recent advances in LLMs. In the afternoon, you meet with engineering teams to advise on model architecture for a new feature, and wrap up by analyzing the results of your latest A/B test on data capture efficiency improvements.\n\nAbout the team\nZappos/Shopbop Catalog Tech team owns the software that drives our photostudio, product cataloging, and integration to Amazon's marketplace. We use Amazon's Leadership Principals and Engineering Expertise but have our own fun vibe. We are located in Madison WI, and Las Vegas NV.\n\nBASIC QUALIFICATIONS\n• 5+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\n• 4+ years of data scientist experience\n• Experience with statistical models e.g. multinomial logistic regression\n• Bachelor's degree\n\nPREFERRED QUALIFICATIONS\n• 2+ years of data visualization using AWS QuickSight, Tableau, R Shiny, etc. experience\n• Experience managing data pipelines\n• Experience as a leader and mentor on a data science team\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $143,300/year in our lowest geographic market up to $247,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.", "apply_link": "https://www.indeed.com/viewjob?jk=81c8874e843fb7d0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.34, "summary": "Location Match: New York", "skills": {"primary_skills": ["AWS", "Classification", "Computer Vision", "Data Pipelines", "Data Visualization", "E-commerce", "Leadership", "MATLAB", "Machine Learning", "Marketplace", "NLP", "Payments", "Python", "R", "SAS", "SQL", "Tableau", "Teams"], "secondary_skills": [], "all_skills": ["AWS", "Classification", "Computer Vision", "Data Pipelines", "Data Visualization", "E-commerce", "Leadership", "MATLAB", "Machine Learning", "Marketplace", "NLP", "Payments", "Python", "R", "SAS", "SQL", "Tableau", "Teams"], "skill_frequency": {"Python": 1, "R": 2, "MATLAB": 1, "SQL": 1, "Tableau": 1, "SAS": 1, "AWS": 1, "Teams": 4, "Machine Learning": 4, "NLP": 1, "Computer Vision": 1, "Data Visualization": 1, "Data Pipelines": 1, "Classification": 3, "Leadership": 3, "E-commerce": 1, "Marketplace": 1, "Payments": 1}, "total_count": 18}, "keywords": [], "evidence_image": null}, {"title": "Staff Data Scientist - Acquisition job at StubHub in New York, NY, Los Angeles, CA", "company": "StubHub", "location": "New York", "description": "Title: Staff Data Scientist - Acquisition\n\nLocation: New York, NY or Los Angeles, CA , United States\n\nJob Description:\n\nStubHub is on a mission to redefine the live event experience on a global scale. Whether someone is looking to attend their first event or their hundredth, we’re here to delight them all the way from the moment they start looking for a ticket until they step through the gate. The same goes for our sellers. From fans selling a single ticket to the promoters of a worldwide stadium tour, we want StubHub to be the safest, most convenient way to offer a ticket to the millions of fans who browse our platform around the world.\n\nAbout the Opportunity:\n\nWe’re seeking a Staff Data Scientist to lead the science and systems that power our paid search marketing. You’ll design the causal measurement stack, ship models that influence bidding and budgeting in real time, and partner with marketing, data, and platform teams to drive profitable, incremental growth.\n\nStubHub is the largest secondary ticket market in the world, generating massive amounts of consumer data that are leveraged to tackle many unique and interesting predictive and inference problems across user acquisition, product recommendations, pricing optimization, ticket fulfillment mitigation, and business forecasting. The core challenge for our marketing efforts is to acquire as many new customers as possible, efficiently, and at the right time in their customer journey, making it a complex and highly impactful domain.\n\nLocation: Hybrid (3 days in office/2 days remote) – New York, NY or Los Angeles, CA\n\nWhat You'll Do:\n\nOwn causal measurement for paid search: Stand up uplift/incrementality frameworks (e.g., doubly robust learners, causal forests, DML, IVs, synthetic control, DiD, BSTS) to quantify lift beyond correlation.\nShip production models: Build and serve models that inform bids, budgets, and query-level targeting using signals like incremental CPA, tROAS, LTV, and heterogenous treatment effects.\nDesign experiments & guardrails: Architect geo/cell tests and online experiments; handle power analysis, pre-trend checks, SUTVA threats, SRM detection, and sequential monitoring.\nIntegrate with ad platforms: Translate science into APIs/feeds for Google Ads, Microsoft Advertising, and SA360; validate against auction dynamics and Quality Score mechanics.\nData & MLOps leadership: Partner with platform teams to instrument events, build reliable feature stores and ETL (batch/stream), and establish monitoring for drift, bias, leakage, and attribution sanity.\nMentor & influence: Provide technical leadership across science, engineering, and marketing; set standards for methodology, code quality, documentation, and reproducibility.\nTell the story: Communicate trade-offs and impact to execs and non-technical partners; make the complex understandable and actionable.\n\nWhat You've Done:\n\n8+ years in applied ML/causal inference (or equivalent) with direct paid search/auction experience.\nExpert in causal methods (uplift modeling, DML, IV, DiD/synth control, BSTS/Bayesian time series) and experimental design.\nStrong software engineering: Python (pandas, numpy, scikit-learn, LightGBM/XGBoost), SQL; experience with Spark and one of AWS/GCP/Azure.\nHands-on with A/B frameworks, power analysis, and measurement diagnostics (SRM, balance, interference).\nProven track record integrating with Google Ads/Microsoft Ads/SA360 and moving the needle on tROAS, CPA, LTV.\nClear communicator who can mentor senior ICs and partner with product/marketing.\n\nNice to Have:\n\nStrong experience with SEM optimization and bidding, particularly from the ad-buyer side.\nRecsys, bandits/RL for bidding/budget pacing, MMM and privacy-aware attribution.\nScala/Java or microservices experience; Airflow/DBT; Kafka/PubSub; Feast or similar feature stores.\nDomain knowledge of auction theory, query taxonomy, brand vs. non-brand dynamics, and budget rebalancing.\n\nStaff-Level Capabilities\n\nTechnical leadership through influence rather than formal management authority\nStrategic thinking with the ability to balance long-term technical vision with immediate organizational needs\nCross-functional collaboration skills to work effectively with Data Science, Product, and Engineering teams\nCommunication skills to inject technical context into high-level organizational discussions\nProblem-solving approach for ambiguous, high-impact technical challenges\nMentorship and sponsorship experience growing junior and mid-level engineers\n\nWhat We Offer:\n\nAccelerated Growth Environment: Immerse yourself in an environment designed for swift skill and knowledge enhancement, where you have the autonomy to lead experiments and tests on a massive scale.\nTop Tier Compensation Package: Enjoy a rewarding compensation package that includes enticing stock incentives, aligning with our commitment to recognizing and valuing your contributions.\nFlexible Time Off: Embrace a healthy work-life balance with unlimited Flex Time Off, providing you the flexibility to manage your schedule and recharge as needed.\nComprehensive Benefits Package: Prioritize your well-being with a comprehensive benefits package, featuring 401k, and premium Health, Vision, and Dental Insurance options.\n\nThe anticipated gross base pay range is below for this role. Actual compensation will vary depending on factors such as a candidate’s qualifications, skills, experience, and competencies. Base annual salary is one component of StubHub’s total compensation and competitive benefits package, which includes equity, 401(k), paid time off, paid parental leave, and comprehensive health benefits.\n\nSalary Range\n\n$300,000 - $350,000 USD\n\nAbout Us\n\nStubHub is the world’s leading marketplace to buy and sell tickets to any live event, anywhere. Through StubHub in North America and viagogo, our international platform, we service customers in 195 countries in 33 languages and 49 available currencies. With more than 300 million tickets available annually on our platform to events around the world -- from sports to music, comedy to dance, festivals to theater -- StubHub offers the safest, most convenient way to buy or sell tickets to the most memorable live experiences. Come join our team for a front-row seat to the action.", "apply_link": "https://remote.co/job-details/staff-data-scientist-acquisition-e97c4d97-992b-415d-baa0-dc9afe25719b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.34, "summary": "Location Match: New York", "skills": {"primary_skills": ["AWS", "Airflow", "Azure", "Causal Inference", "Collaboration", "Communication", "Cross-functional Collaboration", "ETL", "Flexibility", "GCP", "Insurance", "Java", "Kafka", "Leadership", "LightGBM", "MLOps", "Marketplace", "Microservices", "NumPy", "Pandas", "Python", "SQL", "Scala", "Search", "Spark", "Swift", "Teams", "XGBoost", "scikit-learn"], "secondary_skills": [], "all_skills": ["AWS", "Airflow", "Azure", "Causal Inference", "Collaboration", "Communication", "Cross-functional Collaboration", "ETL", "Flexibility", "GCP", "Insurance", "Java", "Kafka", "Leadership", "LightGBM", "MLOps", "Marketplace", "Microservices", "NumPy", "Pandas", "Python", "SQL", "Scala", "Search", "Spark", "Swift", "Teams", "XGBoost", "scikit-learn"], "skill_frequency": {"Python": 1, "Java": 1, "Swift": 2, "Scala": 1, "SQL": 1, "scikit-learn": 1, "XGBoost": 1, "LightGBM": 1, "Pandas": 1, "NumPy": 1, "Spark": 1, "Kafka": 1, "Airflow": 2, "AWS": 1, "Azure": 1, "GCP": 1, "Teams": 3, "ETL": 1, "Microservices": 1, "MLOps": 1, "Causal Inference": 1, "Communication": 1, "Collaboration": 1, "Cross-functional Collaboration": 1, "Leadership": 3, "Flexibility": 1, "Marketplace": 1, "Insurance": 1, "Search": 3}, "total_count": 29}, "keywords": [], "evidence_image": null}, {"title": "Senior Data Scientist - CMX", "company": "CVS Health", "location": "New York", "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\n\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\n\nPosition Summary\n\nAs a Sr. Data Scientist at CMX, you will lead the development and deployment of cutting-edge Generative AI (GenAI) solutions within one of the largest health-aligned enterprise ecosystems. This role focuses on building scalable, production-grade systems using Python and modern frameworks, with applications such as Retrieval-Augmented Generation (RAG) and intelligent agents. You will work at the intersection of data science, engineering, and MLOps, collaborating with stakeholders to clarify requirements and deliver impactful solutions that enhance patient and consumer experiences.\n\nKey Responsibilities\n• In this role, you will:\n• Design and implement GenAI solutions, including RAG pipelines and agent-based systems, for enterprise-scale applications.\n• Build and optimize backend systems using Python and frameworks like FastAPI, ensuring robust and efficient deployments.\n• Collaborate with data engineering and MLOps teams to integrate models into production workflows.\n• Work consultatively with stakeholders to understand business needs, present results, and guide technical decisions.\n• Contribute to best practices for coding standards, workflow efficiency, and distributed computing\n\nRequired Qualifications\n• 3+ years of coding experience (primarily on Python).\n• 3+ years of experience in backend systems development (FastAPI experience is a plus).\n• Proven track record of building and deploying GenAI solutions (e.g., RAG pipelines, agent-based systems).\n• Hands-on experience with GenAI frameworks such as LangChain, LangGraph, or similar.\n• Experience working in cloud environments (GCP, Azure, or AWS).\n• Strong collaboration skills and ability to thrive in agile team settings.\n• Ability to communicate technical concepts effectively to stakeholders.\n\nPreferred Qualifications\n• Experience integrating GenAI solutions and agentic design into enterprise workflows.\n• Exposure to MLOps practices and tools (e.g., Jenkins, Docker)\n• Experience in Front End development\n• Experience in Ad-tech is a plus\n\nEducation\n• Master’s degree or equivalent work experience in a relevant field.\n• PhD preferred.\n\nAnticipated Weekly Hours\n40\n\nTime Type\nFull time\n\nPay Range\n\nThe typical pay range for this role is:\n\n$111,240.00 - $222,480.00\n\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\n\nGreat benefits for great people\n\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\n• Affordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\n• No-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\n• Benefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\n\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\n\nWe anticipate the application window for this opening will close on: 12/28/2025\n\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.", "apply_link": "https://jobs.cvshealth.com/us/en/job/R0722441/Senior-Data-Scientist-CMX?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.34, "summary": "Location Match: New York", "skills": {"primary_skills": ["AWS", "Agile", "Azure", "Coaching", "Collaboration", "Data Engineering", "Docker", "FastAPI", "GCP", "Jenkins", "LangChain", "MLOps", "Python", "RAG", "Teams"], "secondary_skills": [], "all_skills": ["AWS", "Agile", "Azure", "Coaching", "Collaboration", "Data Engineering", "Docker", "FastAPI", "GCP", "Jenkins", "LangChain", "MLOps", "Python", "RAG", "Teams"], "skill_frequency": {"Python": 3, "AWS": 1, "Azure": 1, "GCP": 1, "Docker": 1, "Jenkins": 1, "FastAPI": 2, "Teams": 2, "Agile": 1, "MLOps": 3, "Data Engineering": 1, "LangChain": 1, "RAG": 3, "Collaboration": 1, "Coaching": 1}, "total_count": 15}, "keywords": [], "evidence_image": null}, {"title": "Research Data Scientist, Search Ads", "company": "Google", "location": "New York", "description": "Minimum qualifications:\n• Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, a related quantitative field, or equivalent practical experience.\n• 3 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree.\n\nPreferred qualifications:\n• 5 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree.\n\nAbout the job\n\nIn this role, you will work as part of the Ads Metrics Data Science team, supporting the SAGE (Search Ads and Google Experience) organization in developing Google's ad products, from classic text ads to shopping ads and new products like Discovery ads.\nThe US base salary range for this full-time position is $141,000-$202,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.\n\nResponsibilities\n• Apply quantitative knowledge to manage ambiguous problems, developing and applying advanced statistical and optimization models to find solutions.\n• Design and develop methods and experiments to measure and analyze product quality and user behavior.\n• Extract, manipulate, and analyze datasets using Python and SQL, with an emphasis on developing scalable Data Science solutions.\n• Influence the strategy and direction of flagship products by translating questions into analysis, with a focus on longer-term solutions.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.", "apply_link": "https://www.byp.network/jobs/472388068-research-data-scientist-search-ads-at-google?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.33, "summary": "Location Match: New York", "skills": {"primary_skills": ["Python", "R", "SQL", "Search"], "secondary_skills": [], "all_skills": ["Python", "R", "SQL", "Search"], "skill_frequency": {"Python": 3, "R": 2, "SQL": 3, "Search": 1}, "total_count": 4}, "keywords": [], "evidence_image": null}, {"title": "Senior Data Scientist, Analytics", "company": "David Energy", "location": "New York", "description": "About David Energy\n\nDavid Energy is creating a new kind of power company. Traditional Retail Electricity Providers (REPs) are outdated, opaque, and painful for customers to engage with. We use software to monitor our customers' real-time energy usage, and we aggregate and analyze that data to maximize the value they get from their energy assets – batteries, EVs, HVAC systems and other distributed energy resources (DERs) via participation in energy markets. Our mission is to run the grid on clean energy 24/7.\n\nWe are looking for a senior data scientist to own analyses and data analytics around our growing network of energy assets in concert with real-time energy markets. By shifting the energy usage of our customers to align with the cheapest and cleanest wholesale energy available, we can offer dramatically lower rates with much cleaner energy. Making those decisions automatically at scale requires excellent data science.\n\nIn this role, you will\n• Solve complex business problems (e.g., cost allocation, error detection, data imputation) to deliver insights that advance business initiatives\n• Own and evolve our data ecosystem (Snowflake + dbt) and ensure data is accurate and well-structured\n• Work with cross-functional teams to identify data needs, define metrics, and establish reporting frameworks\n• Contribute to the strategic planning process by presenting findings and recommendations to stakeholders across the company\n• Identify opportunities for process improvements and lead initiatives to increase operational accuracy and efficiency\n• Design and establish a company culture of rigorous, data-informed decision making\n\nWe invite you to apply for this role if you have\n• Clear communication skills with people at all levels of technical ability\n• 5+ years of work experience delivering data analytics and analyses with demonstrated impact\n• Fluency in SQL\n• Ability to deliver in an early-stage startup environment (e.g., proactive ownership, independence in uncertainty)\n\nYou could be an especially great fit if you have\n• Bachelor’s in a quantitative field (e.g., physics, statistics, mathematics, economics)\n• Experience with dbt\n• Experience with Python\n• Experience in energy trading, grid operations, or deregulated energy markets (namely, ERCOT, ISO-NE, NYISO, or PJM)\n\nBenefits:\n• $160,000 plus equity, depending on experience\n• Group medical and dental insurance\n• Flexible vacation/PTO policy\n• 401(k) plan\n• Hybrid office culture, with team members remote and working from our offices in New York City", "apply_link": "https://www.indeed.com/viewjob?jk=caf4e1c87274ce3f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "score": 0.32, "summary": "Location Match: New York", "skills": {"primary_skills": ["Communication", "Decision Making", "Insurance", "Ownership", "Python", "Retail", "SQL", "Snowflake", "Teams"], "secondary_skills": [], "all_skills": ["Communication", "Decision Making", "Insurance", "Ownership", "Python", "Retail", "SQL", "Snowflake", "Teams"], "skill_frequency": {"Python": 1, "SQL": 1, "Snowflake": 2, "Teams": 1, "Communication": 1, "Decision Making": 1, "Ownership": 1, "Insurance": 1, "Retail": 1}, "total_count": 9}, "keywords": [], "evidence_image": null}]